[{"id":"569bfcdc-fad1-4563-ae57-8585831db596","type":"Full Time","url":"https://jobs.github.com/positions/569bfcdc-fad1-4563-ae57-8585831db596","created_at":"Sun Sep 06 14:30:27 UTC 2020","company":"Hotel Trades Council, AFL-CIO","company_url":"http://www.hotelworkers.org","location":"New York, NY","title":"Web Developer","description":"\u003cp\u003eThe New York Hotel Trades Council, AFL-CIO, a labor union that represents nearly 40,000 workers in the hotel, gaming, and racing industries in the New York City area, seeks an experienced web developer.\u003c/p\u003e\n\u003cp\u003eThis COVID crisis has shown us the immense value to our Union of developing a more expansive and sophisticated website. Since March, the number of viewers to our site has increased seven-fold (to as many as 20,000 per day and more) and we are investing our resources accordingly. In fact, we have so many concrete ideas to put the site to new innovative uses, that our one full-time Web Developer has much more work to do than he can possibly handle. Among the new uses we are developing are:\u003c/p\u003e\n\u003cp\u003eConducting secret ballot ratification votes online;\nProviding multi-lingual content to an incredibly diverse membership (the current site supports English, Spanish and Chinese content);\nMobilizing rank-and-file political action in a private individually personalized Member Section;\nProviding non-union workers with a confidential communication channel with the union and interactive pages allowing them to compare their wages, benefits and working conditions to those enjoyed by unionized workers; and\nMany other applications.\u003c/p\u003e\n\u003cp\u003eOur Union constantly seeks new ways to increase our effectiveness through smart use of technology and we are looking for a creative developer to help conceive of, design and implement tools to support the Union in our mission.\u003c/p\u003e\n\u003cp\u003eThis position offers the prospect of a great career and, as we are a labor union, an excellent benefit package.\u003c/p\u003e\n\u003cp\u003eThe team currently works remotely from home due to the COVID situation. When things return to normal, we intend to be flexible about remote work, and will consider skilled applicants who don’t live in the New York area.\u003c/p\u003e\n\u003cp\u003eStarting salary: $70,000 to $85,000\u003c/p\u003e\n\u003cp\u003eBenefits include: Medical, Dental, Optical, and Prescription Drugs with family coverage (including domestic partners); Pension, Pre-paid Legal, Flexible Spending Accounts, Life Cycle Benefits, Long-Term Care Insurance, and other benefits.\u003c/p\u003e\n\u003cp\u003eRequirements:\nAt least 3 years developing websites using an MVC framework (with preference given to specific knowledge of Laravel PHP framework).\nStrong UI/UX design skills\nStrong javascript skills\u003c/p\u003e\n\u003cp\u003eOther useful experience/qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAdvanced experience managing SQL databases\u003c/li\u003e\n\u003cli\u003eLinux server administration\u003c/li\u003e\n\u003cli\u003eNetworking skills\u003c/li\u003e\n\u003cli\u003ePython\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease submit a resume, three references and a cover letter to \u003ca href=\"mailto:careers@nyhtc.org\"\u003ecareers@nyhtc.org\u003c/a\u003e with the subject line “Web Developer.”  The cover letter should be clear and concise and explain the specific reasons for your interest in the position, and specify (with appropriate explanation) which of each of the listed qualifications you possess and which ones you do not possess.\u003c/p\u003e\n\u003cp\u003eThe New York Hotel Trades Council, AFL-CIO, is an equal opportunity employer.  All persons regardless of age, race, ethnicity, gender, religious affiliation and sexual orientation are encouraged to apply.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbE9KIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a30d608a910769a14438f7e0d7f3a673ca961499/HTC%20logo.jpg"},{"id":"04206897-960f-466f-b80f-f2bf88c4f472","type":"Full Time","url":"https://jobs.github.com/positions/04206897-960f-466f-b80f-f2bf88c4f472","created_at":"Thu Sep 03 00:53:36 UTC 2020","company":"Hotel Trades Council, AFL-CIO","company_url":"http://www.hotelworkers.org","location":"New York","title":"FileMaker Pro Developer","description":"\u003cp\u003eThe New York Hotel Trades Council, AFL-CIO, a large New York City labor union, seeks a highly experienced FileMaker Pro Developer to work in its FileMaker Development Department.\u003c/p\u003e\n\u003cp\u003eOur integrated FileMaker system, consisting of over 100 files and thousands of related tables is extremely advanced and ambitious. We use it to manage many aspects of our operation. Furthermore, we are constantly multiplying the innovative ways in which we use it. For that reason, we have made a long-term investment (for over 20 years) in maintaining a permanent in-house FileMaker team, which we want to expand.\u003c/p\u003e\n\u003cp\u003eTherefore, this position offers the prospect of a career and, as we are a labor union, an excellent benefit package.\u003c/p\u003e\n\u003cp\u003eThe team currently works remotely from home due to the COVID situation. When things return to normal, we intend to be flexible about remote work, and will consider skilled applicants who don’t live in the New York area.\u003c/p\u003e\n\u003cp\u003eStarting salary: $75,000 to $90,000\nBenefits include: Medical, Dental, Optical, and Prescription Drugs with family coverage (including domestic partners); Pension, Pre-paid Legal, Flexible Spending Accounts, Life Cycle Benefits, Long-Term Care Insurance, and other benefits.\u003c/p\u003e\n\u003cp\u003eRequirements:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eAt least 5 years building and maintaining business applications using the FileMaker platform\u003c/li\u003e\n\u003cli\u003eAdvanced command of scripting, layout design, custom functions, privilege sets and relationship graph organization\u003c/li\u003e\n\u003cli\u003eCommand of the Mac OS X environment\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eOther useful experience/qualifications:\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eWorking with web services in FileMaker (JSON/XML)\u003c/li\u003e\n\u003cli\u003eUI/UX design\u003c/li\u003e\n\u003cli\u003eAppleScript\u003c/li\u003e\n\u003cli\u003eNetworking skills\u003c/li\u003e\n\u003cli\u003ePython\u003c/li\u003e\n\u003cli\u003eJavaScript\u003c/li\u003e\n\u003c/ul\u003e\n","how_to_apply":"\u003cp\u003ePlease submit a resume, three references and a cover letter to \u003ca href=\"mailto:careers@nyhtc.org\"\u003ecareers@nyhtc.org\u003c/a\u003e with the subject line “FileMaker Pro Developer.” The cover letter should be clear and concise and explain the specific reasons for your interest in the position, and specify (with appropriate explanation) which of each of the listed qualifications you possess and which ones you do not possess. The New York Hotel Trades Council, AFL-CIO, is an equal opportunity employer. All persons regardless of age\u003c/p\u003e\n","company_logo":null},{"id":"13b2df9b-837f-4b50-b009-b3fd6f8c08b4","type":"Full Time","url":"https://jobs.github.com/positions/13b2df9b-837f-4b50-b009-b3fd6f8c08b4","created_at":"Wed Sep 02 14:47:57 UTC 2020","company":"Novartis","company_url":"http://www.novartis.com/careers","location":"East Hanover, NJ","title":"Head Knowledge Graph \u0026 Semantics","description":"\u003cp\u003e2020 is an exciting year for Novartis as we have embraced a bold strategy to drive a company-wide digital transformation !\u003c/p\u003e\n\u003cp\u003eCome and join us as our Head of Knowledge Graph \u0026amp; Semantics for Novartis, to lead efforts in setting the right strategy and roadmap to organize Novartis data, make it easily accessible, and useful to authorized roles. This role will help drive the development and execution of Novartis’ ambition to turn data into a real strategic asset across the organization. This ambition is one of key pillars in the broader digital transformation happening at Novartis to be a ‘medicines and data science company.’ This data centric role will facilitate using data to digitize the biopharma value chain in finding right target, right tissue, right safety, right patients, and right commercial potential and to optimize Omni channel stakeholder experience and engagement.\u003c/p\u003e\n\u003cp\u003eMore specifically, the purpose of this role is to drive, in partnership Digital Data Science and AI teams, over 10+ business units, Technology partners (internal and external) adoption of consistent framework, processes, architecture and supporting tools for analytics needs. This role will help create high quality data assets to enable analytics using data across all bio pharma data domains and value chain; omics, compounds, diseases, patients, payers, providers, sites, trials, KOLs, HCPs, EMR, EHR, patient journeys, employees, contracts, vendors, products, etc.\u003c/p\u003e\n\u003cp\u003eThis role will directly report and work with the Head of Data Strategy in the Group Digital Office.\u003c/p\u003e\n\u003cp\u003eWhat will you be responsible for as our Head of Knowledge Graph \u0026amp; Semantics ?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003eExercise clear and informed decision-making using process transparent to stakeholders for data related investment and creation of data assets for all units and functions. Bringing people together who should talk to each other. Keeping in touch with every data science and analytics stakeholder regularly. Facilitating meetings for the senior stakeholders \u0026amp; teams (preparing, moderation and post processing). Holding retrospectives to refine approach.\u003c/li\u003e\n\u003cli\u003eEscalation point for data related product and service owner \u0026amp; working groups across master data management, data engineering with governance, and information modelling. Mediating the general conflict of goals between teams (technical quality) and product owner (more features).\u003c/li\u003e\n\u003cli\u003eChampion and build awareness and value of Data Science Enablement capabilities. Assess Data Science Enablement maturity. Organizing exchange events like Open Spaces or World Cafés for the team, its stakeholders, and its organization.\u003c/li\u003e\n\u003cli\u003eDrive organic adoption of the capabilities, helps conducts investment planning by utilizing common Data Science Enablement Capabilities. Sharing insights throughout the company (micro-blogging, blogging, internal conferences, etc.).\u003c/li\u003e\n\u003cli\u003eAlign appropriate BU capabilities to Enterprise-level efforts. Drive continuous feedback in product management and svc ownership\u003c/li\u003e\n\u003cli\u003eRefine the Novartis reference Data Science Enablement model and keep it update. Develop service catalog in collaboration functions and ensure alignment of projects to avoid gaps or duplication of effort. Drive key projects (lighthouses) towards using common Data Science Enablement services.\u003c/li\u003e\n\u003cli\u003eDrive strategy and implementation product and services to enable analytics\u003c/li\u003e\n\u003cli\u003eDrive all data domain maturity and related data services to enable Visualization, Descriptive, Inquisitive, Predictive \u0026amp; Cognitive Analytics and Robotics Automation.\u003c/li\u003e\n\u003cli\u003eDefine services to manage usage license, cataloging, search discovery, machine learning readiness, provenance, etc. Optimize data licensing across the Firm.\u003c/li\u003e\n\u003cli\u003eIn alignment with business needs, identify new strategic data sources and data-related collaboration opportunities. Assess value of internal and external data for acquisition/licensing and monetization (data as an asset). Coordinate and align external data engagements, initiatives, and standards.\u003c/li\u003e\n\u003cli\u003eEvolve Novartis data transparency and data sharing strategy. Support BD\u0026amp;L and M\u0026amp;A from data perspective. Identify and leverage opportunities to replace primary data collection with secondary data.\u003c/li\u003e\n\u003cli\u003eDevelop strategy and engagement models for a patient-centric data future. Communicate Novartis data activities to the external health data ecosystem.\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eEEO Statement :\nThe Novartis Group of Companies are Equal Opportunity Employers and take pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or any other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, marital or veteran status, disability, or any other legally protected status.\u003c/p\u003e\n\u003cp\u003eWhat will you bring to the role ?\u003c/p\u003e\n\u003cul\u003e\n\u003cli\u003e10 + experience in data management and data strategy in industry\u003c/li\u003e\n\u003cli\u003eHands on experience with managing Data Science Enablement related activities across many of biopharma data domains e.g. omics, compounds, diseases, patients, payers, CROs, sites, trials, KOLs, HCPs, EMR, EHR, claims, patient journeys, employees, contracts, vendors, products, etc.\u003c/li\u003e\n\u003cli\u003eDemonstrated leadership of use case based agile implementation of data strategy in cross-organizational and cross-functional teams.\u003c/li\u003e\n\u003cli\u003eProven track record in implementing a Data Science Enablement program from scratch in Pharma or other multinational, multi-business organizations\u003c/li\u003e\n\u003cli\u003eGeneral understanding of data driven commercial potential for differentiated value proposition verses future standard of care, focus on market access, drivers of regulatory compliant omnichannel engagement and experiences with patients, payer and provider. Understand personalized healthcare strategy, digital medicines, including diagnostic and biomarkers.\u003c/li\u003e\n\u003cli\u003eAdvance knowledge of data Visualization tools and techniques. Expertise in Descriptive, Inquisitive, and Predictive analytics. Working knowledge of Cognitive Analytics and Robotics Automation. Deep understanding if data science workflow and productivity issues related to data availability, quality and productionizing data science. Ability to code in R and/or Python.\u003c/li\u003e\n\u003cli\u003eData Distribution capability through APIs for Apps to Analysts to semantically search and find data assets without needing to understand exactly where it is physically stored and maintained.\u003c/li\u003e\n\u003cli\u003eSemantically curated Data APIs to enable complex data API Mashups without user side code. Enable smart Applications, Portals, End Users, Business Intelligence, Analytics, Reports, Dashboards, OLTP, Compliance, B2B, Semantic Browsers, etc.\u003c/li\u003e\n\u003cli\u003eSecurity and Access capability to prevent unauthorized access, use, disclosure, disruption, modification, inspection, recording or destruction of information\u003c/li\u003e\n\u003cli\u003eDemonstrated strong skills in oral and written communication, project management\u003c/li\u003e\n\u003cli\u003eAbility to build relationships, collaborate and influence across a matrix organization\u003c/li\u003e\n\u003cli\u003eAttention to detail, results driven\u003c/li\u003e\n\u003c/ul\u003e\n\u003cp\u003eWhat you'll receive in return ?\nCompetitive salary, annual bonus, long term incentive for select levels, health insurance, paid vacation/holidays, potential flexible working arrangements, subsidized dining facilities, employee recognition scheme.\u003c/p\u003e\n\u003cp\u003eWhy consider Novartis?\u003c/p\u003e\n\u003cp\u003e750 million. That is how many lives our products touch. And while we’re proud of that fact, in this world of digital and technological transformation, we must also ask ourselves this: how can we continue to improve and extend even more people’s lives?\u003c/p\u003e\n\u003cp\u003eWe believe the answers are found when curious, courageous and collaborative people like you are brought together in an inspiring environment. Where you’re given opportunities to explore the power of digital and data. Where you’re empowered to risk failure by taking smart risks, and where you’re surrounded by people who share your determination to tackle the world’s toughest medical challenges.\u003c/p\u003e\n\u003cp\u003eWe are Novartis. Join us and help us reimagine medicine.\u003c/p\u003e\n","how_to_apply":"\u003cp\u003eFor more information about this exciting opportunities, please contact \u003ca href=\"mailto:loic_ricardo.ruffe@novartis.com\"\u003eloic_ricardo.ruffe@novartis.com\u003c/a\u003e from our Americas Digital Talent Acquisition team.\u003c/p\u003e\n","company_logo":"https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHVKIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--00515cab020eb821136657835d3894ce70e752a7/brandsite-novartis-footer-logo.png"}]